---
kind: method
id: M:Autodesk.Revit.DB.Rectangle.Dispose
source: html/858ffb54-a984-beff-5668-4ab69cec515c.htm
---
# Autodesk.Revit.DB.Rectangle.Dispose Method

Releases all resources used by the Rectangle

## Syntax (C#)
```csharp
public void Dispose()
```